app/Controllers/AuthController.php

    public function login()
    {

        $session = session();
        $userModel = new UsersModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'devjajja@gmail.com'
 LIMIT 1