app/Models/BuyersModel.php

    public function contractTypes($fpo)
    {
        $builder = $this->db->table("contract_types");
        $builder->where("fpo", $fpo);
        return $builder->get()->getResultArray();
---
SELECT *
FROM `contract_types`
WHERE `fpo` = 1