app/Models/GradesModel.php

SELECT *
FROM `grade_groups`
WHERE `fpo` = 1
---
    public function gradeGroupsList($fpo)
    {
        $builder = $this->db->table("grade_groups");
        $builder->select();
        $builder->where("fpo", $fpo);
        return $builder->get()->getResultArray();