app/Models/SuppliersModal.php

    public function newValuationSummary($data)
    {
        $valuationSummary = $this->db->table("valuations");
        $valuationSummary->insert($data);
---
INSERT INTO `valuations` (`valuation_date`, `client_id`, `grn`, `fpo`, `prepared_by`) VALUES ('', '', '', 1, 1)

    public function newValuationInventoryItems($data)
    {
        $builder = $this->db->table("inventory");
        return $builder->insertBatch($data);
---
INSERT INTO `inventory` (`client_id`, `currency_id`, `exch_rate`, `grade_id`, `item_no`, `moisture`, `price`, `qty_in`, `store_id`, `trans_date`, `transaction_id`, `transaction_type_id`)
VALUES ('',1,1,'',1,'','0','1',1,'',8,1)

    public function valuationPreview($vId)
    {
        // Inventory Items
        $itemsSql = $this->db->table("inventory");
        $itemsSql->select("grade_id, grade_code, grade_name, unit, qty_in AS qty, price, exch_rate, moisture");
        $itemsSql->join("grades", "grade_id");
        $itemsSql->where("transaction_type_id", 1);
        $itemsSql->where("transaction_id", $vId);
        $data["items"] = $itemsSql->get()->getResultArray();
        // Valuation Summary
        $summary = $this->db->table("valuations");
        $summary->select("valuation_date AS date, client_id AS supplier_id, name AS supplier, grn, prepared_by, time_prepared, approved_by, time_approved");
        $summary->join("clients", "client_id");
        $summary->where("valuation_id", $vId);
        $data["summary"] = $summary->get()->getResultArray()[0];
---
SELECT `grade_id`, `grade_code`, `grade_name`, `unit`, `qty_in` AS `qty`, `price`, `exch_rate`, `moisture`
FROM `inventory`
JOIN `grades` USING (`grade_id`)
WHERE `transaction_type_id` = 1
AND `transaction_id` = '8'
SELECT `valuation_date` AS `date`, `client_id` AS `supplier_id`, `name` AS `supplier`, `grn`, `prepared_by`, `time_prepared`, `approved_by`, `time_approved`
FROM `valuations`
JOIN `clients` USING (`client_id`)
WHERE `valuation_id` = '8'